# 숫자 카드 게임

# 1. 숫자가 쓰인 카드들이 N x M 형태로 놓여있다.
#    이때 N은 행의 개수를 의미하며, M은 열의 개수를 의미한다.
# 2. 먼저 뽑고자 하는 카드가 포함되어 있는 행을 선택한다.
# 3. 그 다음 선택된 행에 포함된 카드들 중 가장 숫자가 낮은 카드를 뽑아야 한다.
# 4. 따라서 처음에 카드를 골라낼 행을 선택할 때, 이후에 해당 행에서 가장 숫자가 낮은 카드를 뽑을 것을 고려하여
#    최종적으로 가장 높은 숫자의 카드를 뽑을 수 있도록 전략을 세워야 한다.

""" 요약
    각 행의 값중 가장 작은 수 들 중에 가장 큰 값이 답이다.
"""
# 입력예시 1                 # 출력예시
# 3 3                       | 2
# 3 1 2                     |
# 4 1 4                     |
# 2 2 2                     |

# 입력예시 2                 # 출력예시
# 2 4                       | 3
# 7 3 1 8                   |
# 3 3 3 4                   |

N, M = map(int, input().split())

def numcardgame(n, m):
    for i in range(n):
        for j in range(m):


    return None

print(numcardgame(N, M))