def recursive(i):
    if i == 50:
        print("==========================================================================")
        return 1757
    print(f"{i}번째 재귀함수에 들어왔습니다. {i+1}번째 재귀함수로 이동하겠습니다.")
    if i % 10 == 0:
        print("==========================================================================")
    print(recursive(i+1))
    print(f"{i}번째 재귀함수를 종료합니다.")
    if i % 10 == 0:
        print("==========================================================================")
        
print(recursive(1))